In [1]:
import mysql.connector
import pandas as pd

In [2]:
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = '@Ravenclaw93',
    database = 'retrowheels'
)

In [3]:
mycursor = mydb.cursor()
query = (
    'SELECT COUNT(distinct customerNumber) as Customer, COUNT(distinct city) as Cities, COUNT(distinct country) as Country FROM customers;'
    )
mycursor.execute(query)
result = mycursor.fetchall()
ans1 = pd.DataFrame(result, columns=mycursor.column_names)
ans1

   Customer  Cities  Country
0       122      95       27

In [4]:
mycursor = mydb.cursor()
query = ('Select  count(distinct(employees.employeeNumber)) as Employees, count(distinct(offices.officeCode)) as Offices, count(distinct(offices.country)) as Country, count(distinct(products.quantityInStock)) as Products, sum(distinct(products.quantityInStock)) as StockProducts,count(distinct(products.productVendor)) as Vendor From employees, offices, products;')
mycursor.execute(query)
result = mycursor.fetchall()
ans2 = pd.DataFrame(result, columns=mycursor.column_names)
ans2

   Employees  Offices  Country  Products StockProducts  Vendor
0         23        7        5       110        555131      13

In [5]:
mycursor = mydb.cursor()
query = ('select productLine, min(buyPrice) as minPrice, max(buyPrice) as maxPrice from products group by productLine;')
mycursor.execute(query)
result = mycursor.fetchall()
ans3 = pd.DataFrame(result, columns=mycursor.column_names)
ans3

        productLine minPrice maxPrice
0      Classic Cars    15.91   103.42
1       Motorcycles    24.14    91.02
2            Planes    29.34    77.27
3             Ships    33.30    82.34
4            Trains    26.72    67.56
5  Trucks and Buses    24.92    84.76
6      Vintage Cars    20.61    86.70

In [6]:
mycursor = mydb.cursor()
query = ('SELECT customerName, city, country, sum(amount) as total FROM customers c, payments p WHERE c.customerNumber = p.customerNumber GROUP BY c.customerNumber ORDER BY total desc LIMIT 10;'
    )
mycursor.execute(query)
result = mycursor.fetchall()
ans4 = pd.DataFrame(result, columns=mycursor.column_names)
ans4

                   customerName           city      country      total
0        Euro+ Shopping Channel         Madrid        Spain  715738.98
1  Mini Gifts Distributors Ltd.     San Rafael          USA  584188.24
2    Australian Collectors, Co.      Melbourne    Australia  180585.07
3            Muscle Machine Inc            NYC          USA  177913.95
4       Dragon Souveniers, Ltd.      Singapore    Singapore  156251.03
5    Down Under Souveniers, Inc     Auckland    New Zealand  154622.08
6                AV Stores, Co.     Manchester           UK  148410.09
7       Anna's Decorations, Ltd   North Sydney    Australia  137034.22
8      Corporate Gift Ideas Co.  San Francisco          USA  132340.78
9        Saveley & Henriot, Co.           Lyon       France  130305.35

In [7]:
mycursor = mydb.cursor()
query = ('SELECT customerName, productName, quantityOrdered, priceEach FROM products pr JOIN orderDetails od ON pr.productCode = od.productCode JOIN orders o ON od.orderNumber = o.orderNumber JOIN customers c ON o.customerNumber = c.customerNumber JOIN payments pa ON c.customerNumber = pa.customerNumber WHERE pa.paymentDate = {d 20030605} LIMIT 4;'
    )
mycursor.execute(query)
result = mycursor.fetchall()
ans5 = pd.DataFrame(result, columns=mycursor.column_names)
ans5

,customerName,productName,quantityOrdered,priceEach
0,Atelier graphique,1965 Aston Martin DB5,26,120.71
1,Atelier graphique,1999 Indy 500 Monte Carlo SS,46,114.84
2,Atelier graphique,1948 Porsche Type 356 Roadster,34,117.26
3,Atelier graphique,1966 Shelby Cobra 427 S/C,50,43.27